"use strict"

//Задача 5.З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран назву транспортного засобу, яким він може керувати.


//Крок 0. Позначення
// категорії водія - driverCategories

//Крок 1. Вводимо необхідні данні

const numberOfSeconds = prompt(
  "Введіть назву категорії водія (А, В, С)",
  ""
).trim();

//Крок 2. Обчислення результату. Ввиведення результатів
switch (numberOfSeconds.toUpperCase()) {
  case "A":
    document.write("Можна керувати мотоциклом");
    break;
  case "B":
    document.write("Можна керувати легковим автомобілем");
    break;
  case "C":
    document.write("Можна керувати вантажним автомобілем");
    break;
  default:
    document.write("Введенні некоректні дані");
    break;
}
