"use strict";

//Задача 2. Дано рік народження (дата: 1 січня) та поточний рік. Знайти кількість років.

//Крок 0. Позначення
// рік народження (дата: 1 січня) - yearOfBirth
// поточний рік - currentYear
//кількість років - age

//Крок 1. Вводимо необхідні данні
const yearOfBirth = parseInt(prompt("Ваш рік народження?", ""));
const currentYear = 2025;

//Крок 2. Обчислення результату
const age = currentYear - yearOfBirth

//КРОК 3. Ввиведення результатів
document.write(`Вам ${age} років`);