"use strict";

//Задача 14. Каса. Користувачу повідомляють суму, яку йому треба сплатити. Користувач поступово вводить суму грошей до тих пір, поки суми не буде достатньо для оплати товарів (кожного разу користувачу повідомляють, яку ще суму потрібно ввести).

if (confirm("Почати тестування?")) {
  let totalSum = 1000;
  let userMoney;
  do {
    userMoney = parseFloat(
      prompt(
        `За товари вам потрібно сплатити ${totalSum}грн. Будь ласка введіть суму до сплати. `
      )
    );
    totalSum -= userMoney;
  } while (totalSum > 0);

  document.write(`Вітаю. Все сплачено.`);
}
