"use strict";

//Задача 3. Ось приклад відповіді з одного з сайтів (масив об’єктів з інформацією про товари)
//(весь текст масиву, що в кінці документу скопіюєте в код).
//1) Загальну вартість (нові ціни - price)
//2)Знайти кількість товарів, у яких ціна зменшилась (price < old_price) 3) Товари, які доступні(sell_status:"available")
// 4) сформувати новий список об”єктів тільки доступних для продажу товарів, які
//міститимуть тільки ідентифікатор товару (id), нову ціну (price), стару ціну (old_price), та ціну у доларах
//(usd_price)

if (confirm("Почати тестування?")) {

}
